---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures
source: html/eb68236e-14db-2bad-514b-6335bae03913.htm
---
# BuiltInFailures.KeyBasedTreeEntryFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.